OpenEIT/EIT_Firmware/inc/ADuCM350_device.h
/*!
 * \struct ADI_GPIO_TypeDef
 * \brief  GPIO
*/
typedef struct
{
    __IO uint32_t GPCON;                         /*!< GPIO Port 0  Configuration */
    __IO uint16_t GPOEN;                         /*!< GPIO Port 0 output enable */
    __I  uint8_t                  RESERVED0[2];
    __IO uint16_t GPPE;                          /*!< GPIO Port 0 output pullup/pulldown enable */
    __I  uint8_t                  RESERVED1[2];
    __IO uint16_t GPIEN;                         /*!< GPIO  Port 0 Input Path Enable */
    __I  uint8_t                  RESERVED2[2];
    __I  uint16_t GPIN;                          /*!< GPIO  Port 0 registered data input */
    __I  uint8_t                  RESERVED3[2];
    __IO uint16_t GPOUT;                         /*!< GPIO Port 0 data output */
    __I  uint8_t                  RESERVED4[2];
    __O  uint16_t GPSET;                         /*!< GPIO Port 0 data out set */
    __I  uint8_t                  RESERVED5[2];
    __O  uint16_t GPCLR;                         /*!< GPIO Port 0 data out clear */
    __I  uint8_t                  RESERVED6[2];
    __O  uint16_t GPTGL;                         /*!< GPIO Port 0  pin toggle */
    __I  uint8_t                  RESERVED7[2];
    __IO uint16_t GPPOL;                         /*!< GPIO Port 0 interrupt polarity */
    __I  uint8_t                  RESERVED8[2];
    __IO uint16_t GPIENA;                        /*!< GPIO Port 0  interrupt A enable */
    __I  uint8_t                  RESERVED9[2];
    __IO uint16_t GPIENB;                        /*!< GPIO Port 0 interrupt B enable */
    __I  uint8_t                 RESERVED10[2];
    __IO uint16_t GPINT;                         /*!< GPIO Port 0 interrupt Status */
} ADI_GPIO_TypeDef;


/*!
 * \struct ADI_SYSCLK_TypeDef
 * \brief  Clock gating and other settings
*/
typedef struct
{
    __IO uint16_t CLKCON0;                       /*!< Misc clock settings */
    __I  uint8_t                  RESERVED0[2];
    __IO uint16_t CLKCON1;                       /*!< Clock dividers */
    __I  uint8_t                  RESERVED1[6];
    __IO uint16_t CLKCON3;                       /*!< System PLL */
    __I  uint8_t                  RESERVED2[2];
    __IO uint16_t CLKCON4;                       /*!< USB PLL */
    __I  uint8_t                  RESERVED3[2];
    __IO uint16_t CLKCON5;                       /*!< User clock gating control */
    __I  uint8_t                  RESERVED4[2];
    __IO uint16_t CLKSTAT0;                      /*!< Clocking status */
} ADI_SYSCLK_TypeDef;


/*!
 * \struct ADI_BUSM_TypeDef
 * \brief  changed from 4002800
*/
typedef struct
{
    __IO uint16_t BMARBIT0;                      /*!< Arbitration Priority Configuration for Slave 0 (Flash) */
    __I  uint8_t                  RESERVED0[2];
    __IO uint16_t BMARBIT1;                      /*!< Arbitration Priority Configuration for Slave 1 (SRAM0) */
    __I  uint8_t                  RESERVED1[2];
    __IO uint16_t BMARBIT2;                      /*!< Arbitration Priority Configuration for Slave 2 (SRAM1 + EEPROM) */
    __I  uint8_t                  RESERVED2[2];
    __IO uint16_t BMARBIT3;                      /*!< Arbitration Priority Configuration for Slave 3 (AFE) */
    __I  uint8_t                  RESERVED3[2];
    __IO uint16_t BMARBIT4;                      /*!< Arbitration Priority Configuration for Slave 4 (32-bit APB) */
    __I  uint8_t                  RESERVED4[2];
    __IO uint16_t BMARBIT5;                      /*!< Arbitration Priority Configuration for Slave 5 (16-bit APB with DMA access) */
} ADI_BUSM_TypeDef;


/*!
 * \struct ADI_CRC_TypeDef
 * \brief  CRC
*/
typedef struct
{
    __IO uint32_t CRC_CTL;                       /*!< CRC Control Register */
    __IO uint32_t CRC_IPDATA;                    /*!< Input Data Register */
    __IO uint32_t CRC_RESULT;                    /*!< CRC Result Register */
} ADI_CRC_TypeDef;


/*!
 * \struct ADI_PDI_TypeDef
 * \brief  PDI
*/
typedef struct
{
    __IO uint32_t PDI_CFG;                       /*!< PDI Configuration  Register */
    __O  uint32_t PDI_INT_SET;                   /*!< PDI Interrupt Set Register */
    __O  uint32_t PDI_INT_CLR;                   /*!< PDI Interrupt Clear Register */
    __IO uint32_t PDI_STAT;                      /*!< PDI Status Register */
    __IO uint32_t PDI_CMD;                       /*!< PDI Command Register */
    __IO uint32_t PDI_FRDATA_N;                  /*!< PDI Frame Data Count Register */
    __IO uint32_t PDI_FIFO;                      /*!< PDI Parameter FIFO */
    __IO uint32_t PDI_IF_TIMING;                 /*!< PDI Interface Timing Register */
} ADI_PDI_TypeDef;


/*!
 * \struct ADI_AFE_TypeDef
 * \brief  AFE Register Map
*/
typedef struct
{
    __IO uint32_t AFE_CFG;                       /*!< AFE Configuration */
    __IO uint32_t AFE_SEQ_CFG;                   /*!< Sequencer Configuration */
    __IO uint32_t AFE_FIFO_CFG;                  /*!< FIFOs Configuration */
    __IO uint32_t AFE_SW_CFG;                    /*!< Switch Matrix Configuration */
    __IO uint32_t AFE_DAC_CFG;                   /*!< DAC Configuration */
    __IO uint32_t AFE_WG_CFG;                    /*!< Waveform Generator Configuration */
    __IO uint32_t AFE_WG_DCLEVEL_1;              /*!< Waveform Generator - Trapezoid DC Level 1 */
    __IO uint32_t AFE_WG_DCLEVEL_2;              /*!< Waveform Generator - Trapezoid DC Level 2 */
    __IO uint32_t AFE_WG_DELAY_1;                /*!< Waveform Generator - Trapezoid Delay 1 Time */
    __IO uint32_t AFE_WG_SLOPE_1;                /*!< Waveform Generator - Trapezoid Slope 1 Time */
    __IO uint32_t AFE_WG_DELAY_2;                /*!< Waveform Generator - Trapezoid Delay 2 Time */
    __IO uint32_t AFE_WG_SLOPE_2;                /*!< Waveform Generator - Trapezoid Slope 2 Time */
    __IO uint32_t AFE_WG_FCW;                    /*!< Waveform Generator - Sinusoid Frequency Control Word */
    __IO uint32_t AFE_WG_PHASE;                  /*!< Waveform Generator - Sinusoid Phase Offset */
    __IO uint32_t AFE_WG_OFFSET;                 /*!< Waveform Generator - Sinusoid Offset */
    __IO uint32_t AFE_WG_AMPLITUDE;              /*!< Waveform Generator - Sinusoid Amplitude */
    __IO uint32_t AFE_ADC_CFG;                   /*!< ADC Configuration */
    __IO uint32_t AFE_SUPPLY_LPF_CFG;            /*!< Supply Rejection Filter Configuration */
    __IO uint32_t AFE_SW_FULL_CFG_MSB;           /*!< Switch Matrix Full Configuration (MSB) */
    __IO uint32_t AFE_SW_FULL_CFG_LSB;           /*!< Switch Matrix Full Configuration (LSB) */
    __IO uint8_t                  RESERVED0[4];
    __IO uint32_t AFE_WG_DAC_CODE;               /*!< Waveform Generator - DAC Code */
    __I  uint32_t AFE_STATUS;                    /*!< AFE Status */
    __I  uint8_t                  RESERVED1[4];
    __I  uint32_t AFE_SEQ_CRC;                   /*!< Sequencer CRC Value */
    __IO uint32_t AFE_SEQ_COUNT;                 /*!< Sequencer Command Count */
    __I  uint32_t AFE_SEQ_TIMEOUT;               /*!< Sequencer Timeout Counter */
    __I  uint32_t AFE_DATA_FIFO_READ;            /*!< Data FIFO Read */
    __O  uint32_t AFE_CMD_FIFO_WRITE;            /*!< Command FIFO Write */
    __IO uint32_t AFE_ADC_RESULT;                /*!< ADC Raw Result */
    __IO uint32_t AFE_DFT_RESULT_REAL;           /*!< DFT Result, Real Part */
    __IO uint32_t AFE_DFT_RESULT_IMAG;           /*!< DFT Result, Imaginary Part */
    __IO uint32_t AFE_SUPPLY_LPF_RESULT;         /*!< Supply Rejection Filter Result */
    __IO uint32_t AFE_TEMP_SENSOR_RESULT;        /*!< Temperature Sensor Result */
    __IO uint8_t                  RESERVED2[4];
    __IO uint32_t AFE_ANALOG_CAPTURE_IEN;        /*!< Analog Capture Interrupt Enable */
    __IO uint32_t AFE_ANALOG_GEN_IEN;            /*!< Analog Generation Interrupt Enable */
    __IO uint32_t AFE_CMD_FIFO_IEN;              /*!< Command FIFO Interrupt Enable */
    __IO uint32_t AFE_DATA_FIFO_IEN;             /*!< Data FIFO Interrupt Enable */
    __IO uint8_t                  RESERVED3[4];
    __IO uint32_t AFE_ANALOG_CAPTURE_INT;        /*!< Analog Capture Interrupt */
    __IO uint32_t AFE_ANALOG_GEN_INT;            /*!< Analog Generation Interrupt */
    __IO uint32_t AFE_CMD_FIFO_INT;              /*!< Command FIFO Interrupt */
    __IO uint32_t AFE_DATA_FIFO_INT;             /*!< Data FIFO Interrupt */
    __I  uint32_t AFE_SW_STATUS_MSB;             /*!< Switch Matrix Status (MSB) */
    __I  uint32_t AFE_SW_STATUS_LSB;             /*!< Switch Matrix Status (LSB) */
    __IO uint32_t AFE_ADCMIN;                    /*!< ADC Minimum Value Check */
    __IO uint32_t AFE_ADCMAX;                    /*!< ADC Maximum Value Check */
    __IO uint32_t AFE_ADCDELTA;                  /*!< ADC Delta Check */
    __I  uint8_t                  RESERVED4[60];
    __IO uint32_t AFE_CAL_DATA_LOCK;             /*!< Calibration Data Lock */
    __IO uint32_t AFE_ADC_GAIN_TIA;              /*!< ADC Gain (TIA Measurement) */
    __IO uint32_t AFE_ADC_OFFSET_TIA;            /*!< ADC Offset (TIA Measurement) */
    __IO uint32_t AFE_ADC_GAIN_TEMP_SENS;        /*!< ADC Gain (Temperature Sensor Measurement) */
    __IO uint32_t AFE_ADC_OFFSET_TEMP_SENS;      /*!< ADC Offset (Temperature Sensor Measurement) */
    __I  uint8_t                  RESERVED5[4];
    __IO uint32_t AFE_ADC_GAIN_AUX;              /*!< ADC Gain (Aux Channel Measurement) */
    __IO uint32_t AFE_ADC_OFFSET_AUX;            /*!< ADC Offset (Aux Channel Measurement) */
    __IO uint32_t AFE_DAC_OFFSET_UNITY;          /*!< DAC Offset With Attenuator Disabled */
    __IO uint32_t AFE_DAC_OFFSET_ATTEN;          /*!< DAC Offset With Attenuator Enabled */
    __IO uint32_t AFE_DAC_GAIN;                  /*!< DAC Gain */
    __IO uint32_t AFE_REF_TRIM0;                 /*!< Precision Reference Trim 0 */
    __IO uint32_t AFE_REF_TRIM1;                 /*!< Precision Reference Trim 1 */
    __IO uint32_t AFE_ALDO_TRIM;                 /*!< Analog LDO Trim */
    __IO uint32_t AFE_DAC_TRIM;                  /*!< DAC Trim */
    __IO uint32_t AFE_INAMP_TRIM;                /*!< INAMP Trim */
    __IO uint32_t AFE_EXBUF_TRIM;                /*!< Excitation Buffer Trim */
    __IO uint32_t AFE_TEMP_SENS_TRIM;            /*!< Temperature Sensor Trim */
} ADI_AFE_TypeDef;


/*!
 * \struct ADI_CT_TypeDef
 * \brief  Captouch Register Map
*/
typedef struct
{
    __IO uint32_t CT_CDC_PWR;                    /*!< Power CDC control */
    __IO uint32_t CT_CFG1;                       /*!< capTouch Control Configuration Register 1 */
    __IO uint32_t CT_CFG2;                       /*!< capTouch Control Configuration Register 2 */
    __IO uint32_t CT_CFG3;                       /*!< AFE Control Configuration Register 3 */
    __IO uint32_t CT_MEAS_SEL;                   /*!< Capacitance measurement stage selection */
    __IO uint32_t CT_BASELINE_CTRL;              /*!< Baseline control settings */
    __IO uint32_t CT_AVG;                        /*!< Setup of the rank-and-average filtering */
    __IO uint32_t CT_CAL_EN;                     /*!< Enable calibration for measurement stages */
    __IO uint32_t CT_TOUCH_CFG1;                 /*!< Touch Detection Thresholds */
    __IO uint32_t CT_TOUCH_CFG2;                 /*!< Touch Detection time-out */
    __IO uint32_t CT_RELEASE_CFG1;               /*!< Release Detection Thresholds */
    __IO uint32_t CT_RELEASE_CFG2;               /*!< Release Detection time-out */
    __IO uint32_t CT_IEN;                        /*!< Interrupt Enable */
    __IO uint32_t CT_INT;                        /*!< Primary Interrupt Register */
    __IO uint32_t CT_OFFS_HSTAT;                 /*!< Stage offset high interrupt status */
    __IO uint32_t CT_OFFS_LSTAT;                 /*!< Stage offset low interrupt status */
    __IO uint32_t CT_PROX_STAT;                  /*!< Stage proximity status */
    __IO uint32_t CT_FPROX_STAT;                 /*!< Stage fast proximity status */
    __IO uint32_t CT_TOUCH_STAT;                 /*!< Stage touch/release status */
    __IO uint32_t CT_STAGE0_CFG;                 /*!< Stage 0 configuration */
    __IO uint32_t CT_STAGE1_CFG;                 /*!< Stage 1 configuration */
    __IO uint32_t CT_STAGE2_CFG;                 /*!< Stage 2 configuration */
    __IO uint32_t CT_STAGE3_CFG;                 /*!< Stage 3 configuration */
    __IO uint32_t CT_STAGE4_CFG;                 /*!< Stage 4 configuration */
    __IO uint32_t CT_STAGE5_CFG;                 /*!< Stage 5 configuration */
    __IO uint32_t CT_STAGE6_CFG;                 /*!< Stage 6 configuration */
    __IO uint32_t CT_STAGE7_CFG;                 /*!< Stage 7 configuration */
    __IO uint32_t CT_STAGE8_CFG;                 /*!< Stage 8 configuration */
    __IO uint32_t CT_STAGE9_CFG;                 /*!< Stage 9 configuration */
    __IO uint32_t CT_STAGE10_CFG;                /*!< Stage 10 configuration */
    __IO uint32_t CT_STAGE11_CFG;                /*!< Stage 11 configuration */
    __IO uint32_t CT_STAGE12_CFG;                /*!< Stage 12 configuration */
    __IO uint32_t CT_STAGE13_CFG;                /*!< Stage 13 configuration */
    __IO uint32_t CT_STAGE14_CFG;                /*!< Stage 14 configuration */
    __IO uint32_t CT_STAGE15_CFG;                /*!< Stage 15 configuration */
    __IO uint32_t CT_SENSOR_THR_CFG0;            /*!< Stage 0 and Stage 1 Sensor Threshold */
    __IO uint32_t CT_SENSOR_THR_CFG1;            /*!< Stage 2 and Stage 3 Sensor Threshold */
    __IO uint32_t CT_SENSOR_THR_CFG2;            /*!< Stage 4 and Stage 5 Sensor Threshold */
    __IO uint32_t CT_SENSOR_THR_CFG3;            /*!< Stage 6 and Stage 7 Sensor Threshold */
    __IO uint32_t CT_SENSOR_THR_CFG4;            /*!< Stage 8 and Stage 9 Sensor Threshold */
    __IO uint32_t CT_SENSOR_THR_CFG5;            /*!< Stage 10 and Stage 11 Sensor Threshold */
    __IO uint32_t CT_SENSOR_THR_CFG6;            /*!< Stage 12 and Stage 13 Sensor Threshold */
    __IO uint32_t CT_SENSOR_THR_CFG7;            /*!< Stage 14 and Stage 15 Sensor Threshold */
    __I  uint32_t CT_CDC_RES0;                   /*!< Stage 0 and Stage 1 Results */
    __I  uint32_t CT_CDC_RES1;                   /*!< Stage 2 and Stage 3 Results */
    __I  uint32_t CT_CDC_RES2;                   /*!< Stage 4 and Stage 5 Results */
    __I  uint32_t CT_CDC_RES3;                   /*!< Stage 6 and Stage 7 Results */
    __I  uint32_t CT_CDC_RES4;                   /*!< Stage 8 and Stage 9 Results */
    __I  uint32_t CT_CDC_RES5;                   /*!< Stage 10 and Stage 11 Results */
    __I  uint32_t CT_CDC_RES6;                   /*!< Stage 12 and Stage 13 Results */
    __I  uint32_t CT_CDC_RES7;                   /*!< Stage 14 and Stage 15 Results */
    __I  uint32_t CT_BASELINE0;                  /*!< Stage 0 Fast Filter and Baseline Results */
    __I  uint32_t CT_BASELINE1;                  /*!< Stage 1 Fast Filter and Baseline Results */
    __I  uint32_t CT_BASELINE2;                  /*!< Stage 2 Fast Filter and Baseline Results */
    __I  uint32_t CT_BASELINE3;                  /*!< Stage 3 Fast Filter and Baseline Results */
    __I  uint32_t CT_BASELINE4;                  /*!< Stage 4 Fast Filter and Baseline Results */
    __I  uint32_t CT_BASELINE5;                  /*!< Stage 5 Fast Filter and Baseline Results */
    __I  uint32_t CT_BASELINE6;                  /*!< Stage 6 Fast Filter and Baseline Results */
    __I  uint32_t CT_BASELINE7;                  /*!< Stage 7 Fast Filter and Baseline Results */
    __I  uint32_t CT_BASELINE8;                  /*!< Stage 8 Fast Filter and Baseline Results */
    __I  uint32_t CT_BASELINE9;                  /*!< Stage 9 Fast Filter and Baseline Results */
    __I  uint32_t CT_BASELINE10;                 /*!< Stage 10 Fast Filter and Baseline Results */
    __I  uint32_t CT_BASELINE11;                 /*!< Stage 11 Fast Filter and Baseline Results */
    __I  uint32_t CT_BASELINE12;                 /*!< Stage 12 Fast Filter and Baseline Results */
    __I  uint32_t CT_BASELINE13;                 /*!< Stage 13 Fast Filter and Baseline Results */
    __I  uint32_t CT_BASELINE14;                 /*!< Stage 14 Fast Filter and Baseline Results */
    __I  uint32_t CT_BASELINE15;                 /*!< Stage 15 Fast Filter and Baseline Results */
    __I  uint32_t CT_PK2PK0;                     /*!< Stage 0 and Stage 1 Peak-to-Peak Noise Results */
    __I  uint32_t CT_PK2PK1;                     /*!< Stage 2 and Stage 3 Peak-to-Peak Noise Results */
    __I  uint32_t CT_PK2PK2;                     /*!< Stage 4 and Stage 5 Peak-to-Peak Noise Results */
    __I  uint32_t CT_PK2PK3;                     /*!< Stage 6 and Stage 7 Peak-to-Peak Noise Results */
    __I  uint32_t CT_PK2PK4;                     /*!< Stage 8 and Stage 9 Peak-to-Peak Noise Results */
    __I  uint32_t CT_PK2PK5;                     /*!< Stage 10 and Stage 11 Peak-to-Peak Noise Results */
    __I  uint32_t CT_PK2PK6;                     /*!< Stage 12 and Stage 13 Peak-to-Peak Noise Results */
    __I  uint32_t CT_PK2PK7;                     /*!< Stage 14 and Stage 15 Peak-to-Peak Noise Results */
} ADI_CT_TypeDef;


/*!
 * \struct ADI_USB_EP0_TypeDef
 * \brief  Endpoint 0
*/
typedef struct
{
    __I  uint8_t                  RESERVED0[2];
    union {
    __IO uint16_t CSR_P;                         /*!< EP0 Configuration and Status (Peripheral) Register */
    __IO uint16_t CSR_H;                         /*!< EP0 Configuration and Status (Host) Register */
    };
    __I  uint8_t                  RESERVED1[4];
    __I  uint16_t CNT;                           /*!< EP0 Number of Received Bytes Register */
    __I  uint8_t                  RESERVED2[5];
    __I   uint8_t CFGDATA;                       /*!< EP0 Configuration Information Register */
} ADI_USB_EP0_TypeDef;


/*!
 * \struct ADI_USB_DMA_TypeDef
 * \brief  DMA Block (1-8)
*/
typedef struct
{
    __IO uint16_t CTL;                           /*!< DMA Channel n Control Register */
    __I  uint8_t                  RESERVED0[2];
    __IO uint32_t ADDR;                          /*!< DMA Channel n Address Register */
    __IO uint32_t CNT;                           /*!< DMA Channel n Count Register */
    __I  uint8_t                  RESERVED1[4];
} ADI_USB_DMA_TypeDef;


/*!
 * \struct ADI_USB_EP0I_TypeDef
 * \brief  Endpoint 0 Indexed Block
*/
typedef struct
{
    __I  uint8_t                  RESERVED0[2];
    union {
    __IO uint16_t CSR_P;                         /*!< EP0 Configuration and Status (Peripheral) Register */
    __IO uint16_t CSR_H;                         /*!< EP0 Configuration and Status (Host) Register */
    };
    __I  uint8_t                  RESERVED1[4];
    __I  uint16_t CNT;                           /*!< EP0 Number of Received Bytes Register */
    __I  uint8_t                  RESERVED2[5];
    __I   uint8_t CFGDATA;                       /*!< EP0 Configuration Information Register */
} ADI_USB_EP0I_TypeDef;


/*!
 * \struct ADI_USB_EPI_TypeDef
 * \brief  Endpoint Indexed Block
*/
typedef struct
{
    __IO uint16_t TXMAXP;                        /*!< EPn Transmit Maximum Packet Length Register */
    union {
    __IO uint16_t TXCSR_H;                       /*!< EPn Transmit Configuration and Status (Host) Register */
    __IO uint16_t TXCSR_P;                       /*!< EPn Transmit Configuration and Status (Peripheral) Register */
    };
    __IO uint16_t RXMAXP;                        /*!< EPn Receive Maximum Packet Length Register */
    union {
    __IO uint16_t RXCSR_H;                       /*!< EPn Receive Configuration and Status (Host) Register */
    __IO uint16_t RXCSR_P;                       /*!< EPn Receive Configuration and Status (Peripheral) Register */
    };
    __I  uint16_t RXCNT;                         /*!< EPn Number of Bytes Received Register */
    __I  uint8_t                  RESERVED0[5];
    __IO  uint8_t FIFOSIZE;                      /*!< FIFO size */
} ADI_USB_EPI_TypeDef;


/*!
 * \struct ADI_USB_EP_TypeDef
 * \brief  Endpoint Block
*/
typedef struct
{
    __IO uint16_t TXMAXP;                        /*!< EPn Transmit Maximum Packet Length Register */
    union {
    __IO uint16_t TXCSR_P;                       /*!< EPn Transmit Configuration and Status (Peripheral) Register */
    __IO uint16_t TXCSR_H;                       /*!< EPn Transmit Configuration and Status (Host) Register */
    };
    __IO uint16_t RXMAXP;                        /*!< EPn Receive Maximum Packet Length Register */
    union {
    __IO uint16_t RXCSR_P;                       /*!< EPn Receive Configuration and Status (Peripheral) Register */
    __IO uint16_t RXCSR_H;                       /*!< EPn Receive Configuration and Status (Host) Register */
    };
    __I  uint16_t RXCNT;                         /*!< EPn Number of Bytes Received Register */
    __I  uint8_t                  RESERVED0[5];
    __IO  uint8_t FIFOSIZE;                      /*!< FIFO size */
} ADI_USB_EP_TypeDef;


/*!
 * \struct ADI_USB_FIFO_TypeDef
 * \brief  FIFO Block (0 - 11)
*/
typedef struct
{
    union {
    __IO uint32_t FIFO;                          /*!< FIFO Word (32-Bit) Register */
    __IO uint16_t H;                             /*!< FIFO Half-Word (16-Bit) Register */
    __IO  uint8_t B;                             /*!< FIFO Byte (8-Bit) Register */
    };
} ADI_USB_FIFO_TypeDef;


