OpenEIT/EIT_Firmware/inc/ADuCM350_device.h
/*!
 * \struct ADI_USB_TypeDef
 * \brief  Universal Serial Bus Controller
*/
typedef struct
{
    __IO  uint8_t FADDR;                         /*!< Function Address Register */
    __IO  uint8_t POWER;                         /*!< Power and Device Control Register */
    __I  uint16_t INTRTX;                        /*!< Transmit Interrupt Register */
    __I  uint16_t INTRRX;                        /*!< Receive Interrupt Register */
    __IO uint16_t INTRTXE;                       /*!< Transmit Interrupt Enable Register */
    __IO uint16_t INTRRXE;                       /*!< Receive Interrupt Enable Register */
    __I   uint8_t IRQ;                           /*!< Common Interrupts Register */
    __IO  uint8_t IEN;                           /*!< Common Interrupts Enable Register */
    __I  uint16_t FRAME;                         /*!< Frame Number Register */
    __IO  uint8_t INDEX;                         /*!< Index Register */
    __IO  uint8_t TESTMODE;                      /*!< Testmode Register */
    union {
    ADI_USB_EP0I_TypeDef EP0I;                   /*!< Endpoint 0 Indexed Block */
    ADI_USB_EPI_TypeDef EPI;                     /*!< Endpoint Indexed Block */
      };
    ADI_USB_FIFO_TypeDef FIFO[4];                /*!< FIFO Block (0 - 11) */
    __I  uint8_t                  RESERVED0[48];
    __IO  uint8_t DEV_CTL;                       /*!< Device Control Register */
    __IO  uint8_t MISC;                          /*!< Miscellaneous Register */
    __I  uint8_t                  RESERVED1[22];
    __I   uint8_t EPINFO;                        /*!< Endpoint Information Register */
    __I   uint8_t RAMINFO;                       /*!< RAM Information Register */
    __IO  uint8_t LINKINFO;                      /*!< Link Information Register */
    __I  uint8_t                  RESERVED2[2];
    __IO  uint8_t FS_EOF1;                       /*!< Full-Speed EOF 1 Register */
    __I  uint8_t                  RESERVED3;
    __IO  uint8_t SOFT_RST;                      /*!< Software Reset Register */
    __I  uint8_t                  RESERVED4[128];
    union {
    ADI_USB_EP0_TypeDef EP0;                     /*!< Endpoint 0 */
    ADI_USB_EP_TypeDef EP[4];                    /*!< Endpoint Block */
      };
    __I  uint8_t                  RESERVED5[192];
    __I   uint8_t DMA_IRQ;                       /*!< DMA Interrupt Register */
    __I  uint8_t                  RESERVED6[3];
    ADI_USB_DMA_TypeDef DMA[2];                  /*!< DMA Block (1-8) */
    __I  uint8_t                  RESERVED7[284];
    __IO uint16_t RXDPKTBUFDIS;                  /*!< RX Double Packet Buffer Disable for Endpoints 1 to 3 */
    __IO uint16_t TXDPKTBUFDIS;                  /*!< TX Double Packet Buffer Disable  for Endpoints 1 to 3 */
    __IO uint16_t CT_UCH;                        /*!< Chirp Timeout Register */
    __I  uint8_t                  RESERVED8[26];
    __IO uint16_t LPM_ATTR;                      /*!< LPM Attribute Register */
    __IO  uint8_t LPM_CTL;                       /*!< LPM Control Register */
    __IO  uint8_t LPM_IEN;                       /*!< LPM Interrupt Enable Register */
    __I   uint8_t LPM_IRQ;                       /*!< LPM Interrupt Status Register */
    __I  uint8_t                  RESERVED9[55];
    __IO uint16_t PHY_CTL;                       /*!< FS PHY Control */
    __I  uint16_t PHY_STAT;                      /*!< FS PHY Status */
    __I  uint8_t                 RESERVED10[16];
    __IO uint32_t RAM_ADDR;                      /*!< RAM Address Register */
    __IO uint32_t RAM_DATA;                      /*!< RAM Data Register */
} ADI_USB_TypeDef;


/*!
 * \struct ADI_NVIC_TypeDef
 * \brief
*/
typedef struct
{
    __I  uint8_t                  RESERVED0[4];
    __IO uint32_t INTNUM;                        /*!< Interrupt Control Type */
    __I  uint8_t                  RESERVED1[8];
    __IO uint32_t STKSTA;                        /*!< Systick Control and Status */
    __IO uint32_t STKLD;                         /*!< Systick Reload Value */
    __IO uint32_t STKVAL;                        /*!< Systick Current Value */
    __IO uint32_t STKCAL;                        /*!< Systick Calibration Value */
    __I  uint8_t                  RESERVED2[224];
    __IO uint32_t INTSETE0;                      /*!< IRQ0..31 Set_Enable */
    __IO uint32_t INTSETE1;                      /*!< IRQ32..63 Set_Enable */
    __I  uint8_t                  RESERVED3[120];
    __IO uint32_t INTCLRE0;                      /*!< IRQ0..31 Clear_Enable */
    __IO uint32_t INTCLRE1;                      /*!< IRQ32..63 Clear_Enable */
    __I  uint8_t                  RESERVED4[120];
    __IO uint32_t INTSETP0;                      /*!< IRQ0..31 Set_Pending */
    __IO uint32_t INTSETP1;                      /*!< IRQ32..63 Set_Pending */
    __I  uint8_t                  RESERVED5[120];
    __IO uint32_t INTCLRP0;                      /*!< IRQ0..31 Clear_Pending */
    __IO uint32_t INTCLRP1;                      /*!< IRQ32..63 Clear_Pending */
    __I  uint8_t                  RESERVED6[120];
    __IO uint32_t INTACT0;                       /*!< IRQ0..31 Active Bit */
    __IO uint32_t INTACT1;                       /*!< IRQ32..63 Active Bit */
    __I  uint8_t                  RESERVED7[248];
    __IO uint32_t INTPRI0;                       /*!< IRQ0..3 Priority */
    __IO uint32_t INTPRI1;                       /*!< IRQ4..7 Priority */
    __IO uint32_t INTPRI2;                       /*!< IRQ8..11 Priority */
    __IO uint32_t INTPRI3;                       /*!< IRQ12..15 Priority */
    __IO uint32_t INTPRI4;                       /*!< IRQ16..19 Priority */
    __IO uint32_t INTPRI5;                       /*!< IRQ20..23 Priority */
    __IO uint32_t INTPRI6;                       /*!< IRQ24..27 Priority */
    __IO uint32_t INTPRI7;                       /*!< IRQ28..31 Priority */
    __IO uint32_t INTPRI8;                       /*!< IRQ32..35 Priority */
    __IO uint32_t INTPRI9;                       /*!< IRQ36..39 Priority */
    __IO uint32_t INTPRI10;                      /*!< IRQ40..43 Priority */
    __I  uint8_t                  RESERVED8[2260];
    __IO uint32_t INTCPID;                       /*!< CPUID Base */
    __IO uint32_t INTSTA;                        /*!< Interrupt Control State */
    __IO uint32_t INTVEC;                        /*!< Vector Table Offset */
    __IO uint32_t INTAIRC;                       /*!< Application Interrupt/Reset Control */
    __IO uint16_t INTCON0;                       /*!< System Control */
    __I  uint8_t                  RESERVED9[2];
    __IO uint32_t INTCON1;                       /*!< Configuration Control */
    __IO uint32_t INTSHPRIO0;                    /*!< System Handlers 4-7 Priority */
    __IO uint32_t INTSHPRIO1;                    /*!< System Handlers 8-11 Priority */
    __IO uint32_t INTSHPRIO3;                    /*!< System Handlers 12-15 Priority */
    __IO uint32_t INTSHCSR;                      /*!< System Handler Control and State */
    __IO uint32_t INTCFSR;                       /*!< Configurable Fault Status */
    __IO uint32_t INTHFSR;                       /*!< Hard Fault Status */
    __IO uint32_t INTDFSR;                       /*!< Debug Fault Status */
    __IO uint32_t INTMMAR;                       /*!< Mem Manage Address */
    __IO uint32_t INTBFAR;                       /*!< Bus Fault Address */
    __IO uint32_t INTAFSR;                       /*!< Auxiliary Fault Status */
    __IO uint32_t INTPFR0;                       /*!< Processor Feature Register 0 */
    __IO uint32_t INTPFR1;                       /*!< Processor Feature Register 1 */
    __IO uint32_t INTDFR0;                       /*!< Debug Feature Register 0 */
    __IO uint32_t INTAFR0;                       /*!< Auxiliary Feature Register 0 */
    __IO uint32_t INTMMFR0;                      /*!< Memory Model Feature Register 0 */
    __IO uint32_t INTMMFR1;                      /*!< Memory Model Feature Register 1 */
    __IO uint32_t INTMMFR2;                      /*!< Memory Model Feature Register 2 */
    __IO uint32_t INTMMFR3;                      /*!< Memory Model Feature Register 3 */
    __IO uint32_t INTISAR0;                      /*!< ISA Feature Register 0 */
    __IO uint32_t INTISAR1;                      /*!< ISA Feature Register 1 */
    __IO uint32_t INTISAR2;                      /*!< ISA Feature Register 2 */
    __IO uint32_t INTISAR3;                      /*!< ISA Feature Register 3 */
    __IO uint32_t INTISAR4;                      /*!< ISA Feature Register 4 */
    __I  uint8_t                 RESERVED10[396];
    __IO uint32_t INTTRGI;                       /*!< Software Trigger Interrupt Register */
    __I  uint8_t                 RESERVED11[204];
    __IO uint32_t INTPID4;                       /*!< Peripheral Identification Register 4 */
    __IO uint32_t INTPID5;                       /*!< Peripheral Identification Register 5 */
    __IO uint32_t INTPID6;                       /*!< Peripheral Identification Register 6 */
    __IO uint32_t INTPID7;                       /*!< Peripheral Identification Register 7 */
    __IO uint32_t INTPID0;                       /*!< Peripheral Identification Bits7:0 */
    __IO uint32_t INTPID1;                       /*!< Peripheral Identification Bits15:8 */
    __IO uint32_t INTPID2;                       /*!< Peripheral Identification Bits16:23 */
    __IO uint32_t INTPID3;                       /*!< Peripheral Identification Bits24:31 */
    __IO uint32_t INTCID0;                       /*!< Component Identification Bits7:0 */
    __IO uint32_t INTCID1;                       /*!< Component Identification Bits15:8 */
    __IO uint32_t INTCID2;                       /*!< Component Identification Bits16:23 */
    __IO uint32_t INTCID3;                       /*!< Component Identification Bits24:31 */
} ADI_NVIC_TypeDef;

/** Peripheral Memory Map Declarations
  */
#define ADI_GPT0_BASE                  0x40000000    /*!<  Base address of GPT0 */
#define ADI_GPT1_BASE                  0x40000400    /*!<  Base address of GPT1 */
#define ADI_GPT2_BASE                  0x40000800    /*!<  Base address of GPT2 */
#define ADI_PWR_BASE                   0x40002400    /*!<  Base address of PWR */
#define ADI_WUT_BASE                   0x40002500    /*!<  Base address of WUT */
#define ADI_WDT_BASE                   0x40002580    /*!<  Base address of WDT */
#define ADI_RTC_BASE                   0x40002600    /*!<  Base address of RTC */
#define ADI_I2C_BASE                   0x40003000    /*!<  Base address of I2C */
#define ADI_SPI0_BASE                  0x40004000    /*!<  Base address of SPI0 */
#define ADI_SPI1_BASE                  0x40004400    /*!<  Base address of SPI1 */
#define ADI_UART_BASE                  0x40005000    /*!<  Base address of UART */
#define ADI_I2S_BASE                   0x40005800    /*!<  Base address of I2S */
#define ADI_BEEP_BASE                  0x40005c00    /*!<  Base address of BEEP */
#define ADI_RNG_BASE                   0x40006000    /*!<  Base address of RNG */
#define ADI_LCD_BASE                   0x40008000    /*!<  Base address of LCD */
#define ADI_DMA_BASE                   0x40010000    /*!<  Base address of DMA */
#define ADI_FEE0_BASE                  0x40018000    /*!<  Base address of FEE0 */
#define ADI_FEE1_BASE                  0x40018100    /*!<  Base address of FEE1 */
#define ADI_GPF_BASE                   0x4001c000    /*!<  Base address of GPF */
#define ADI_GPIO0_BASE                 0x40020000    /*!<  Base address of GPIO0 */
#define ADI_GPIO1_BASE                 0x40020040    /*!<  Base address of GPIO1 */
#define ADI_GPIO2_BASE                 0x40020080    /*!<  Base address of GPIO2 */
#define ADI_GPIO3_BASE                 0x400200c0    /*!<  Base address of GPIO3 */
#define ADI_GPIO4_BASE                 0x40020100    /*!<  Base address of GPIO4 */
#define ADI_SPIH_BASE                  0x40024000    /*!<  Base address of SPIH */
#define ADI_SYSCLK_BASE                0x40028000    /*!<  Base address of SYSCLK */
#define ADI_BUSM_BASE                  0x40028040    /*!<  Base address of BUSM */
#define ADI_CRC_BASE                   0x4002c000    /*!<  Base address of CRC */
#define ADI_PDI_BASE                   0x40030000    /*!<  Base address of PDI */
#define ADI_AFE_BASE                   0x40080000    /*!<  Base address of AFE */
#define ADI_CT_BASE                    0x40084000    /*!<  Base address of CT */
#define ADI_USB_BASE                   0x400a0000    /*!<  Base address of USB */
#define ADI_NVIC_BASE                  0xe000e000    /*!<  Base address of NVIC */

/* @} */

