OpenEIT/EIT_Firmware/inc/ADuCM350_device.h
/*******************************************************************************
 *    Peripheral Pointer Declarations
 *******************************************************************************
 * @defgroup PPTRDEC Peripheral Pointer Declarations
 * \addtogroup PPTRDEC
 * @{
 */
#define pADI_GPT0                      ((ADI_GPT_TypeDef      *) ADI_GPT0_BASE       ) /*!<  Pointer to General Purpose Timer (GPT0) */
#define pADI_GPT1                      ((ADI_GPT_TypeDef      *) ADI_GPT1_BASE       ) /*!<  Pointer to General Purpose Timer (GPT1) */
#define pADI_GPT2                      ((ADI_GPT_TypeDef      *) ADI_GPT2_BASE       ) /*!<  Pointer to General Purpose Timer (GPT2) */
#define pADI_PWR                       ((ADI_PWR_TypeDef      *) ADI_PWR_BASE        ) /*!<  Pointer to  (PWR) */
#define pADI_WUT                       ((ADI_WUT_TypeDef      *) ADI_WUT_BASE        ) /*!<  Pointer to WUT (WUT) */
#define pADI_WDT                       ((ADI_WDT_TypeDef      *) ADI_WDT_BASE        ) /*!<  Pointer to WDT (WDT) */
#define pADI_RTC                       ((ADI_RTC_TypeDef      *) ADI_RTC_BASE        ) /*!<  Pointer to Real-Time Clock (RTC) */
#define pADI_I2C                       ((ADI_I2C_TypeDef      *) ADI_I2C_BASE        ) /*!<  Pointer to I2C Master/Slave (I2C) */
#define pADI_SPI0                      ((ADI_SPI_TypeDef      *) ADI_SPI0_BASE       ) /*!<  Pointer to SPI (SPI0) */
#define pADI_SPI1                      ((ADI_SPI_TypeDef      *) ADI_SPI1_BASE       ) /*!<  Pointer to SPI (SPI1) */
#define pADI_UART                      ((ADI_UART_TypeDef     *) ADI_UART_BASE       ) /*!<  Pointer to UART (UART) */
#define pADI_I2S                       ((ADI_I2S_TypeDef      *) ADI_I2S_BASE        ) /*!<  Pointer to I2S serial port (I2S) */
#define pADI_BEEP                      ((ADI_BEEP_TypeDef     *) ADI_BEEP_BASE       ) /*!<  Pointer to Beeper Driver (BEEP) */
#define pADI_RNG                       ((ADI_RNG_TypeDef      *) ADI_RNG_BASE        ) /*!<  Pointer to Random Number Generator (RNG) */
#define pADI_LCD                       ((ADI_LCD_TypeDef      *) ADI_LCD_BASE        ) /*!<  Pointer to LCD Controller (LCD) */
#define pADI_DMA                       ((ADI_DMA_TypeDef      *) ADI_DMA_BASE        ) /*!<  Pointer to DMA (DMA) */
#define pADI_FEE0                      ((ADI_FEE_TypeDef      *) ADI_FEE0_BASE       ) /*!<  Pointer to Flash Controller1 (FEE0) */
#define pADI_FEE1                      ((ADI_FEE_TypeDef      *) ADI_FEE1_BASE       ) /*!<  Pointer to Flash Controller1 (FEE1) */
#define pADI_GPF                       ((ADI_FEE_TypeDef      *) ADI_GPF_BASE        ) /*!<  Pointer to General Purpose Flash Controller (GPF) */
#define pADI_GPIO0                     ((ADI_GPIO_TypeDef     *) ADI_GPIO0_BASE      ) /*!<  Pointer to GPIO (GPIO0) */
#define pADI_GPIO1                     ((ADI_GPIO_TypeDef     *) ADI_GPIO1_BASE      ) /*!<  Pointer to GPIO (GPIO1) */
#define pADI_GPIO2                     ((ADI_GPIO_TypeDef     *) ADI_GPIO2_BASE      ) /*!<  Pointer to GPIO (GPIO2) */
#define pADI_GPIO3                     ((ADI_GPIO_TypeDef     *) ADI_GPIO3_BASE      ) /*!<  Pointer to GPIO (GPIO3) */
#define pADI_GPIO4                     ((ADI_GPIO_TypeDef     *) ADI_GPIO4_BASE      ) /*!<  Pointer to GPIO (GPIO4) */
#define pADI_SPIH                      ((ADI_SPI_TypeDef      *) ADI_SPIH_BASE       ) /*!<  Pointer to SPI (SPIH) */
#define pADI_SYSCLK                    ((ADI_SYSCLK_TypeDef   *) ADI_SYSCLK_BASE     ) /*!<  Pointer to Clock gating and other settings (SYSCLK) */
#define pADI_BUSM                      ((ADI_BUSM_TypeDef     *) ADI_BUSM_BASE       ) /*!<  Pointer to changed from 4002800 (BUSM) */
#define pADI_CRC                       ((ADI_CRC_TypeDef      *) ADI_CRC_BASE        ) /*!<  Pointer to CRC (CRC) */
#define pADI_PDI                       ((ADI_PDI_TypeDef      *) ADI_PDI_BASE        ) /*!<  Pointer to PDI (PDI) */
#define pADI_AFE                       ((ADI_AFE_TypeDef      *) ADI_AFE_BASE        ) /*!<  Pointer to AFE Register Map (AFE) */
#define pADI_CT                        ((ADI_CT_TypeDef       *) ADI_CT_BASE         ) /*!<  Pointer to Captouch Register Map (CT) */
#define pADI_USB                       ((ADI_USB_TypeDef      *) ADI_USB_BASE       ) /*!<  Pointer to Universal Serial Bus Controller (USB) */
#define pADI_NVIC                      ((ADI_NVIC_TypeDef     *) ADI_NVIC_BASE       ) /*!<  Pointer to  (NVIC) */

/* @} */

#endif

